# ПАМЯТКА

# Если нужно найти наименьшую длину А и функция истина - A = 0, f != 1
# Если нужно найти наименьшую длину А и функция ложна - A = 0, f != 0
# Если нужно найти наибольшую длину А и функция истина - A = 1, f != 0
# Если нужно найти наибольшую длину А и функция ложна - A = 1, f != 1


for x in [k * 0.25 for k in range(-10000, 10000)]:
    A = 1
    P = 25 <= x <= 50
    Q = 32 <= x <= 47

    f = (((not A) <= P) <= (A <= Q))

    if f != 0:
        print(x)

def f(x):
    B = 36 <= x <= 75
    C = 60 <= x <= 110
    A = a1 <= x <= a2
    return (not A) <= (B == C)


r = []
d = [y for x in [110, 75, 36, 60] for y in [x, x - 0.1, x + 0.1]]

for a1 in d:
    for a2 in d:
        if a2 >= a1 and all(f(x) for x in d):
            r += [a2 - a1]
print(round(min(r)))
